In [1]:
import numpy as np
import pandas as pd
import pandas_datareader.data as web

In [9]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM','MSFT','GOOG' ]}

In [10]:
all_data

{'AAPL':                   High         Low  ...       Volume   Adj Close
 Date                                ...
 2016-01-27   24.157499   23.334999  ...  533478800.0   21.637739
 2016-01-28   23.629999   23.097500  ...  222715200.0   21.792925
 2016-01-29   24.334999   23.587500  ...  257666000.0   22.545681
 2016-02-01   24.177500   23.850000  ...  163774000.0   22.334911
 2016-02-02   24.010000   23.570000  ...  149428800.0   21.883259
 ...                ...         ...  ...          ...         ...
 2021-01-19  128.710007  126.940002  ...   90757300.0  127.830002
 2021-01-20  132.490005  128.550003  ...  104319500.0  132.029999
 2021-01-21  139.669998  133.589996  ...  120529500.0  136.869995
 2021-01-22  139.850006  135.020004  ...  113907200.0  139.070007
 2021-01-25  145.089996  136.539993  ...  157282400.0  142.919998

 [1258 rows x 6 columns],
 'IBM':                   High         Low  ...      Volume   Adj Close
 Date                                ...
 2016-01-27  123.370003  120.650002  ...   5026400.0   97.300804
 2016-01-28  122.830002  121.010002  ...   3942500.0   98.314354
 2016-01-29  124.790001  122.959999  ...   8248100.0  100.381676
 2016-02-01  125.290001  123.709999  ...   3574900.0  100.413864
 2016-02-02  124.139999  122.639999  ...   3287300.0   98.893547
 ...                ...         ...  ...         ...         ...
 2021-01-19  129.589996  128.089996  ...   5398000.0  129.020004
 2021-01-20  131.059998  128.559998  ...   5598700.0  130.080002
 2021-01-21  132.240005  130.050003  ...  12819200.0  131.649994
 2021-01-22  120.699997  117.360001  ...  38031500.0  118.610001
 2021-01-25  119.540001  117.449997  ...  13681800.0  118.580002

 [1258 rows x 6 columns],
 'MSFT':                   High         Low  ...      Volume   Adj Close
 Date                                ...
 2016-01-27   52.200001   51.020000  ...  36775200.0   46.739880
 2016-01-28   52.209999   51.250000  ...  62513800.0   47.506405
 2016-01-29   55.090000   54.000000  ...  83611700.0   50.271385
 2016-02-01   55.090000   54.500000  ...  44208500.0   49.924614
 2016-02-02   54.259998   52.650002  ...  56313800.0   48.364185
 ...                ...         ...  ...         ...         ...
 2021-01-19  216.979996  212.630005  ...  30480900.0  216.440002
 2021-01-20  225.789993  217.289993  ...  37777300.0  224.339996
 2021-01-21  226.300003  222.419998  ...  30749600.0  224.970001
 2021-01-22  230.070007  225.800003  ...  30124900.0  225.949997
 2021-01-25  229.779999  224.220001  ...  33113100.0  229.529999

 [1258 rows x 6 columns],
 'GOOG':                    High          Low  ...   Volume    Adj Close
 Date                                  ...
 2016-01-27   718.234985   694.390015  ...  2194200   699.989990
 2016-01-28   733.690002   712.349976  ...  2676400   730.960022
 2016-01-29   744.989990   726.799988  ...  3474300   742.950012
 2016-02-01   757.859985   743.270020  ...  5139200   752.000000
 2016-02-02   789.869995   764.650024  ...  6348100   764.650024
 ...                 ...          ...  ...      ...          ...
 2021-01-19  1809.275024  1741.459961  ...  1734600  1790.859985
 2021-01-20  1903.709961  1825.530029  ...  2490300  1886.900024
 2021-01-21  1934.859985  1887.109985  ...  2063900  1891.250000
 2021-01-22  1910.949951  1881.760010  ...  1272100  1901.050049
 2021-01-25  1929.579956  1867.530029  ...  1926800  1899.400024

 [1258 rows x 6 columns]}

In [11]:
all_data['GOOG']

                   High          Low  ...   Volume    Adj Close
Date                                  ...
2016-01-27   718.234985   694.390015  ...  2194200   699.989990
2016-01-28   733.690002   712.349976  ...  2676400   730.960022
2016-01-29   744.989990   726.799988  ...  3474300   742.950012
2016-02-01   757.859985   743.270020  ...  5139200   752.000000
2016-02-02   789.869995   764.650024  ...  6348100   764.650024
...                 ...          ...  ...      ...          ...
2021-01-19  1809.275024  1741.459961  ...  1734600  1790.859985
2021-01-20  1903.709961  1825.530029  ...  2490300  1886.900024
2021-01-21  1934.859985  1887.109985  ...  2063900  1891.250000
2021-01-22  1910.949951  1881.760010  ...  1272100  1901.050049
2021-01-25  1929.579956  1867.530029  ...  1926800  1899.400024

[1258 rows x 6 columns]

In [17]:
price = pd.DataFrame({ticker: data['Adj Close'] for (ticker,data) in all_data.items()})

In [22]:
price.head()

                 AAPL         IBM       MSFT        GOOG
Date
2016-01-27  21.637739   97.300804  46.739880  699.989990
2016-01-28  21.792925   98.314354  47.506405  730.960022
2016-01-29  22.545681  100.381676  50.271385  742.950012
2016-02-01  22.334911  100.413864  49.924614  752.000000
2016-02-02  21.883259   98.893547  48.364185  764.650024

In [19]:
volum = pd.DataFrame({ticker:data['Volume']   for (ticker,data) in all_data.items()})

In [21]:
volum.head()

                   AAPL        IBM        MSFT     GOOG
Date
2016-01-27  533478800.0  5026400.0  36775200.0  2194200
2016-01-28  222715200.0  3942500.0  62513800.0  2676400
2016-01-29  257666000.0  8248100.0  83611700.0  3474300
2016-02-01  163774000.0  3574900.0  44208500.0  5139200
2016-02-02  149428800.0  3287300.0  56313800.0  6348100

In [23]:
returns = price.pct_change()

In [25]:
returns.head()

                AAPL       IBM      MSFT      GOOG
Date
2016-01-27       NaN       NaN       NaN       NaN
2016-01-28  0.007172  0.010417  0.016400  0.044244
2016-01-29  0.034541  0.021028  0.058202  0.016403
2016-02-01 -0.009349  0.000321 -0.006898  0.012181
2016-02-02 -0.020222 -0.015141 -0.031256  0.016822

In [26]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.454506  0.713342  0.653832
IBM   0.454506  1.000000  0.540598  0.504335
MSFT  0.713342  0.540598  1.000000  0.778145
GOOG  0.653832  0.504335  0.778145  1.000000

In [28]:
returns['AAPL'].corr(returns['IBM'])

0.4545062793891152

In [29]:
returns['AAPL'].corr(returns['GOOG'])

0.6538323113958822

Using DataFrameâ€™s corrwith method, you can compute pairwise correlations between a DataFrameâ€™s columns or rows with another Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column:

In [30]:
returns.corrwith(returns.IBM)

AAPL    0.454506
IBM     1.000000
MSFT    0.540598
GOOG    0.504335
dtype: float64

<h1>Data Loading, Storage, and File Formats</h1>

In [31]:
data = pd.read_csv('data.csv', delimiter=',')

In [32]:
data

  College     Name  Age  Class
0      GC  Farhhan   23  BS CS
1    Agri    Umair   25  BS CS
2      GC    Faraz   22  BS CS
3  GC LHR    Ahsan   23  BS CS
4      GC    Waqas   23  BS CS

In [33]:
data1 = pd.read_excel('data.xls')

In [34]:
data1

  College     Name  Age  Class
0      GC  Farhhan   23  BS CS
1    Agri    Umair   25  BS CS
2      GC    Faraz   22  BS CS
3  GC LHR    Ahsan   23  BS CS
4      GC    Waqas   23  BS CS

In [35]:
df = pd.DataFrame(data)

In [36]:
df

  College     Name  Age  Class
0      GC  Farhhan   23  BS CS
1    Agri    Umair   25  BS CS
2      GC    Faraz   22  BS CS
3  GC LHR    Ahsan   23  BS CS
4      GC    Waqas   23  BS CS

In [37]:
df.to_csv('dt.csv')

In [38]:
df.to_json('data.json')